Repository: benhsu0828/IosApp
Catalog: 學習程式設計 2.playgroundbook/Contents/PrivateResources/*.lproj/SwiftDiagnostics.strings
Languages: no, vi

source: missing condition in a 'while' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du må legge til en betingelse i 'while'-uttrykket.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần thêm một điều kiện vào câu lệnh 'while' của mình

source: expected expression in 'switch' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger et uttrykk i 'switch'-uttrykket.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một biểu thức trong câu lệnh 'switch'

source: use of local variable %0 before its declaration
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du må deklarere variabelen %0 før du bruker den.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần khai báo biến %0 trước khi sử dụng

source: value of tuple type %0 has no member %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Tuppelverdi av typen %0 mangler medlem %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Giá trị của kiểu tập hợp %0 không có thành viên %1

source: expected expression after unary operator
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk etter unær operator.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức sau toán tử đơn phân

source: extraneous argument label%select{|s}0 '%1' in %select{call|subscript}2
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Fremmed argumentetikett%select{|s}0 '%1' i %select{call|subscript}2.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Nhãn đối số ngoại lai %select{|s}0 '%1' trong %select{call|subscript}2

source: instance member %1 cannot be used on type %0; did you mean to use a value of this type instead?
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Instansmedlem %1 kan ikke brukes på typen %0 – mente du egentlig å bruke en verdi av denne typen i stedet?
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể sử dụng thành viên thể hiện %1 trên kiểu %0; có phải ý bạn là sử dụng một giá trị thuộc kiểu này thay thế không?

source: operator with postfix spacing cannot start a subexpression
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Operatorer med postfix-mellomrom kan ikke starte et deluttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Toán tử có giãn cách hậu tố không thể bắt đầu một biểu thức con

source: expected 'while' after body of 'repeat' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en 'while' etter et 'repeat'-uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một 'while' sau câu lệnh 'repeat'

source: expected '{' after 'else'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en '{' etter et 'else'-uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một '{' sau câu lệnh 'else'

source: expected identifier after '.' expression
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet en identifikator etter '.'
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có một mã định danh sau dấu '.'

source: expected ')' in expression list
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du mangler en ')' i uttrykket ditt.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn đang thiếu một ')' trong biểu thức

source: ambiguous reference to member %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Tvetydig referanse til medlem %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Tham chiếu mơ hồ đến thành viên %0

source: expected type
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet type.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có loại

source: expected initial value after '='
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en verdi etter '='.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một giá trị sau dấu '='

source: unexpected '%0' separator
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uventet '%0'-skilletegn.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: dấu phân cách '%0' ngoài dự kiến

source: type %0 does not conform to protocol %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Typen %0 stemmer ikke overens med protokollen %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: kiểu %0 không tuân theo giao thức %1

source: partial application of %select{function with 'inout' parameters|'mutating' method|'super.init' initializer chain|'self.init' initializer delegation}0 is not allowed
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Delvis bruk av %select{function with 'inout' parameters|'mutating' method|'super.init' initializer chain|'self.init' initializer delegation}0 er ikke tillatt.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Một phần ứng dụng của %select{function with 'inout' parameters|'mutating' method|'super.init' initializer chain|'self.init' initializer delegation}0 không được phép

source: type of expression is ambiguous without more context
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uttrykkstypen er tvetydig uten mer kontekst.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Kiểu của biểu thức mơ hồ khi không có thêm ngữ cảnh

source: ambiguous use of %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Tvetydig bruk av %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Cách sử dụng của %0 mơ hồ

source: argument labels '%0' do not match any available overloads
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Argumentetikettene '%0' passer ikke sammen med noe som er tilgjengelig. Sjekk funksjonen eller initiereren du prøver å kalle, og pass på å bruke riktige argumenter.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Các nhãn đối số '%0' mà bạn đang sử dụng không khớp với bất kỳ thứ gì khả dụng. Hãy kiểm tra hàm hoặc trình khởi chạy mà bạn đang cố gắng gọi và đảm bảo sử dụng các đối số khớp.

source: %0 initializer is inaccessible due to '%select{private|fileprivate|internal|%error|%error}1' protection level
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Initiereren %0 er utilgjengelig på grunn av beskyttelsesnivået '%select{private|fileprivate|internal|%error|%error}1'.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Trình khởi chạy %0 không thể truy cập được do cấp độ bảo vệ '%select{private|fileprivate|internal|%error|%error}1'

source: expected 'in' after for-each pattern
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du må bruke en 'in' etter et for-each-mønster.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một 'in' sau khuôn mẫu for-each

source: expected initialization in a 'for' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet initiering i et 'for'-uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có phần khởi tạo trong câu lệnh 'for'

source: cannot call value of non-function type %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke kalle verdi av ikke-funksjonstype %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể gọi giá trị của loại không phải hàm %0

source: %0 is unavailable: %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: %0 er utilgjengelig: %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: %0 không khả dụng: %1

source: left side of mutating operator isn't mutable: %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Venstre side av muterende operator kan ikke dempes: %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Vế bên trái của toán tử biến đổi không biến đổi được: %0

source: incorrect argument label%select{|s}0 in %select{call|subscript}3 (have '%1', expected '%2')
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Feil argumentetikett%select{|s}0 i %select{call|subscript}3 (har '%1', forventet '%2').
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Nhãn đối số không đúng %select{|s}0 trong %select{call|subscript}3 (có '%1', dự kiến '%2')

source: cannot invoke %select{|initializer for type }2'%0' with an argument list of type '%1'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke påkalle %select{|initializer for type }2'%0' med en argumentliste av typen '%1'.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể gọi %select{|initializer for type }2'%0' bằng danh sách đối số thuộc loại '%1'

source: type annotation missing in pattern
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Typemerking mangler i mønsteret.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Thiếu chú thích kiểu trong khuôn mẫu

source: 'switch' statement body must have at least one 'case' or 'default' block
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: 'switch'-uttrykk må ha minst én 'case'- eller 'default'-blokk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Phần thân của câu lệnh 'switch' phải có ít nhất một khối 'case' hoặc 'default'

source: unterminated string literal
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uavsluttet strenglitteral.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Chuỗi ký tự không đổi chưa kết thúc

source: unnamed parameters must be written with the empty name '_'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Parametre uten navn må skrives med det tomme navnet '_'.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Các tham số chưa đặt tên phải được viết bằng tên trống '_'

source: expression resolves to an unused l-value
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uttrykket løses til en ubrukt I-verdi.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Biểu thức phân giải thành một l-value không được sử dụng

source: variable used within its own initial value
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du kan ikke bruke den samme variabelen til å angi opprinnelig verdi.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn không thể sử dụng cùng một biến để đặt giá trị ban đầu

source: expected ';' in 'for' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet ';' i 'for'-uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có ';' trong câu lệnh 'for'

source: keyword '%0' cannot be used as an identifier here
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Nøkkelordet '%0' kan ikke brukes som en identifikator her.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể sử dụng từ khóa '%0' dưới dạng mã định danh tại đây

source: expression resolves to an unused function
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uttrykket leder til en ubrukt funksjon.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Biểu thức phân giải thành một hàm không được sử dụng

source: expected '{' in body of function declaration
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '{' i teksten til en funksjonsdeklarasjon.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '{' trong phần thân của khai báo hàm

source: consecutive statements on a line must be separated by ';'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Konsekutive uttrykk på en linje må skilles med ';'.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Các câu lệnh liên tiếp trên một dòng phải được phân tách bằng ';'

source: argument passed to call that takes no arguments
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Argument sendt til et kall som ikke tar argumenter.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Đối số được chuyển vào lệnh gọi không sử dụng đối số

source: assigning a variable to itself
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Tilordner en variabel til seg selv.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Đang gán một biến cho chính nó

source: missing argument for parameter #%0 in call
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Manglende argument for parameter nr. %0 i kallet.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Thiếu đối số cho tham số #%0 trong lệnh gọi

source: single-quoted string literal found, use '\"'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Fant et litteral med enkelt anførselstegn – bruk «\"».
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Đã tìm thấy chuỗi ký tự không đổi được trích dẫn đơn, sử dụng '\"'

source: binary operator '%0' cannot be applied to operands of type %1 and %2
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Binæroperatoren '%0' kan ikke brukes operander av typene %1 og %2.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể áp dụng toán tử nhị phân '%0' cho các toán hạng thuộc loại %1 và %2

source: expected member name or constructor call after type name
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet en medlemsnavn eller konstruktørkall etter typenavn.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có tên thành viên hoặc lệnh gọi phương thức khởi tạo sau tên loại

source: missing condition in an 'if' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en betingelse i et 'if'-uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một điều kiện trong câu lệnh 'if'

source: expected '(' in argument list of function declaration
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '(' i argumentlisten med funksjonsdeklarasjon.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '(' trong danh sách đối số của khai báo hàm

source: type %0 has no member %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Typen %0 har ikke noe medlem %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: kiểu %0 không có thành viên %1

source: parameter requires an explicit type
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Parameteren krever en eksplisitt type.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Tham số yêu cầu một kiểu tường minh

source: invalid character in source file
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Ugyldig tegn i kildefilen.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Ký tự không hợp lệ trong tệp nguồn

source: closure expression is unused
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Closure-blokk-uttrykk er ikke brukt.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Biểu thức bao đóng không được sử dụng

source: empty collection literal requires an explicit type
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Tomt samlingslitteral krever en eksplisitt type.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Chuỗi ký tự bộ sưu tập trống yêu cầu một kiểu tường minh

source: expected '%0' separator
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '%0'-skilletegn.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có dấu phân cách '%0'

source: binary operator '%0' cannot be applied to two %1 operands
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Binæroperatoren '%0' kan ikke brukes på to %1-operander.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể áp dụng toán tử nhị phân '%0' cho hai toán hạng %1

source: ambiguous use of operator %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Tvetydig bruk av operator %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Cách sử dụng của toán tử %0 mơ hồ

source: expected '{' after 'switch' subject expression
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '{' etter 'switch'-subjektuttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '{' sau biểu thức chủ đề 'switch'

source: expected expression, var, or let in 'if' condition
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk, var, eller let i 'if'-betingelsen.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức, var hoặc let trong điều kiện 'if'

source: expected parameter type following ':'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet parameternavn etter ':'
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có loại tham số đứng sau dấu ':'

source: ';' statements are not allowed
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: ';'-uttrykk er ikke tillatt.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không cho phép các câu lệnh ';'

source: expected '{' in 'for' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '{' i 'for'-uttrykket.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '{' trong câu lệnh 'for'

source: '%select{var|let}0' cannot appear nested inside another 'var' or 'let' pattern
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: '%select{var|let}0' kan ikke vises nøstet inni et annet 'var'- eller 'let'-mønster.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: '%select{var|let}0' không thể xuất hiện được lồng bên trong một khuôn mẫu 'var' hoặc 'let' khác

source: expected expression in list of expressions
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk i listen med uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức trong danh sách các biểu thức

source: expected identifier in %0 declaration
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet identifikator i %0-deklarasjonen.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có một mã định danh trong khai báo %0

source: expected a digit after integer literal prefix
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet et tall etter litteralprefiks for et heltall.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có một chữ số sau tiền tố ký tự số nguyên

source: invalid redeclaration of %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Ugyldig redeklarasjon av %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Việc khai báo lại không hợp lệ của %0

source: %1 is not %select{convertible to|a subtype of}0 %2
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: %1 er ikke %select{convertible to|a subtype of}0 %2.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: %1 không phải là %select{convertible to|a subtype of}0 %2
