Repository: benhsu0828/IosApp
Catalog: 學習程式設計 2.playgroundbook/Contents/PrivateResources/*.lproj/SwiftDiagnostics.strings
Languages: no, vi

source: cannot assign value of type %0 to type %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke tilordne verdi av typen %0 til type %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể gán giá trị thuộc loại %0 cho loại %1

source: cannot assign to immutable expression of type %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uttrykket av typen %0 er uforanderlig (det kan aldri endres), og du kan derfor ikke gi det en ny verdi.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Biểu thức thuộc kiểu %0 không biến đổi (không thể thay đổi được) và do đó bạn không thể cung cấp một giá trị khác cho biểu thức.

source: expected '}' at end of brace statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '}' på slutten av klammeparentesuttrykket.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '}' ở cuối câu lệnh dấu ngoặc nhọn

source: editor placeholder in source file
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du må fylle ut denne plassholderen.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần điền vào trình giữ chỗ này

source: unary operator cannot be separated from its operand
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Unæroperatoren kan ikke være adskilt fra operanden.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể tách toán tử đơn phân từ toán hạng của nó

source: %0 is not a %select{binary|prefix unary|postfix unary}1 operator
no: Oi, her er det en feil. Sjekk koden rundt denne linjen for å se om du kan fikse den. Feil: %0 er ikke en %select{binary|prefix unary|postfix unary}1-operator.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: %0 không phải là một toán tử %select{binary|prefix unary|postfix unary}1

source: '=' must have consistent whitespace on both sides
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: '=' må ha samme antall mellomrom på begge sider.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: '=' phải có số lượng khoảng trắng giống nhau ở cả hai bên

source: expected '{' after 'if' condition
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '{' etter 'if'-betingelse.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '{' sau điều kiện 'if'

source: missing argument label%select{|s}0 '%1' in %select{call|subscript}2
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Manglende argumentetikett%select{|s}0 '%1' i %select{call|subscript}2.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Thiếu nhãn đối số %select{|s}0 '%1' trong %select{call|subscript}2

source: cannot subscript a value of type %0 with an index of type %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke bruke en indeksverdi av typen %0 med en indeks av typen %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể tạo chỉ số dưới cho giá trị thuộc loại %0 với một chỉ mục thuộc loại %1

source: cannot invoke %select{|initializer for type }1'%0' with no arguments
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke påkalle %select{|initializer for type }1'%0' uten argumenter.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể gọi %select{|initializer for type }1'%0' mà không có đối số

source: expected '{' after 'repeat'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en '{' etter 'repeat'.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một '{' sau 'repeat'

source: expected '{' after 'while' condition
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en '{' etter en 'while'-betingelse.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một '{' sau điều kiện 'while'

source: found an unexpected second identifier in %0 declaration; is there an accidental break?
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Fant en uventet ekstra identifikator i %0-deklarasjonen – er det et uventet brudd?
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Đã tìm thấy một mã định danh thứ hai ngoài dự kiến trong khai báo %0; đó có phải là một dấu ngắt tình cờ không?

source: cannot assign to value: %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke tilordne til verdi %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể gán cho giá trị %0

source: argument type %0 does not conform to expected type %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Argumenttypen %0 samsvarer ikke med den forventede typen %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Loại đối số %0 không tuân theo loại được dự kiến %1

source: expected pattern
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet mønster.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có khuôn mẫu

source: top-level statement cannot begin with a closure expression
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uttrykk på øverste nivå kan ikke starte med et closure-blokk-uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Câu lệnh cấp cao nhất không thể bắt đầu với một biểu thức bao đóng

source: expected expression
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức

source: expected expression after operator
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk etter operator.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức sau toán tử

source: expected '}' at end of closure
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet '}' på slutten av closure-blokk.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có '}' ở cuối bao đóng

source: reference to member %0 cannot be resolved without a contextual type
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Referanse til medlem %0 kan ikke løses uten en kontekstuell type.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể phân giải tham chiếu đến thành viên %0 mà không có kiểu ngữ cảnh

source: unexpected 'else' immediately following 'if' condition
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Uventet 'else' rett etter 'if-betingelsen.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: 'else' ngoài dự kiến đứng ngay sau điều kiện 'if'

source: use of unresolved %select{identifier|operator}1 %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Bruk av uløst %select{identifier|operator}1 %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Sử dụng %select{identifier|operator}1 %0 chưa phân giải

source: use of undeclared type %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Bruk av udeklarert type %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Sử dụng kiểu %0 chưa khai báo

source: curried function declaration syntax has been removed; use a single parameter list
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Curryfunksjonsdeklarasjonssyntaks er fjernet – bruk kun én parameterliste.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Cú pháp khai báo hàm Curry đã bị xóa; sử dụng một danh sách tham số duy nhất

source: expected expression, var, or let in 'while' condition
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk, var, eller let i 'while'-betingelsen.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức, var hoặc let trong điều kiện 'while'

source: use of '=' in a boolean context, did you mean '=='?
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du brukte '=', som er en oppgaveoperator i en boolsk sammenligningskontekst. Mente du '=='?
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn đã sử dụng '=', là một toán tử gán, trong ngữ cảnh so sánh boolean, có phải ý của bạn là '==' không?

source: expected condition in 'for' statement
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en betingelse i 'for'-uttrykket.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một điều kiện trong câu lệnh 'for'

source: expected parameter name followed by ':'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet parameternavn etterfulgt av ':'
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có tên tham số đứng trước dấu ':'

source: adjacent operators are in non-associative precedence group %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Operatorer ved siden av hverandre er i en ikke-assosiativ presedensgruppe %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Các toán tử liền kề nằm trong nhóm ưu tiên không liên kết %0

source: expected '{' to start the body of for-each loop
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du trenger en '{' på begynnelsen av teksten for en for-each-løkke.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn cần một '{' để bắt đầu phần thân của vòng lặp for-each

source: cannot force unwrap value of non-optional type %0
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du kan ikke tvinge utpakkingsverdi av ikke-valgfri type %0.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn không thể bắt buộc mở gói giá trị thuộc kiểu không tùy chọn %0

source: extra argument in call
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Ekstra argument i kallet.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Thừa đối số trong lệnh gọi

source: expected Sequence expression for for-each loop
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet sekvensuttrykk i for-each-løkke.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức Trình tự trong vòng lặp for-each

source: missing argument for parameter %0 in call
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Manglende argument for parameter %0 i kallet.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Thiếu đối số cho tham số %0 trong lệnh gọi

source: extraneous whitespace after '.' is not permitted
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Du kan ikke ha mellomrom etter '.'
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Bạn không thể có khoảng trắng sau dấu '.'

source: extraneous '}' at top level
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Ekstra '}' på øverste nivå.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Thừa '}' ở mức cao nhất

source: value of type %0 has no member %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Verdien av typen %0 har ikke noe medlem %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Giá trị của kiểu %0 không có thành viên %1

source: expected expression in assignment
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet uttrykk i oppgaven.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có biểu thức trong lệnh gán

source: cannot convert value of type %0 to expected argument type %1
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Kan ikke konvertere verdi av typen %0 til den forventede argumenttypen %1.
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Không thể chuyển đổi giá trị thuộc loại %0 thành loại đối số dự kiến %1

source: expected member name following '.'
no: Oi, her er det en feil. Kontroller koden rundt denne linjen for å se om du kan fikse den. Feil: Forventet medlemsnavn etter '.'
vi: Ồ, bạn có một lỗi. Hãy kiểm tra mã của bạn xung quanh dòng này để thử và sửa lỗi. Lỗi: Dự kiến có tên thành viên sau dấu '.'
